class TAM:
    def __init__(self):
        with open('suratha_tam_replacements_edited.txt', encoding='utf-8') as f:
            lines=f.read().split('\n')
            replacements=[]
            for line in lines:
                if line.count('~')==1:
                    replacements.append(line.split('~'))
                else:
                    pass
                    #print(line)
                    #print('Error!')
            self.replacements=[tuple(r) for r in replacements]
            print(len(replacements),'TAM to Unicode replacements read!')
    def to_unicode(self,text):
        for a,b in self.replacements:
            text=b.join(text.split(a))
        return text
    def self_test(self):
        text_tam="""Þšõèö£Œ¾èO™ Ë™è¬÷ ËŸè ðò¡ð´‹ î‚èO (10), ¶EèO™ à¼õ
        õ®õ¬ñŠ¹è¬÷ õ¬óõîŸ° àð«ò£èŠð´ˆîŠð´‹ â½‹Hô£ù ÃKò º¬ùèœªè£‡ì
        ÉK¬è (20), îPJ™ ªî£ƒèM´‹ è¼ƒè™ ñŸÁ‹ ²´ñ‡í£™ ªêŒòŠð†ì °‡´,
        ªê‹Hù£ô£ù áC, ²´ñ‡ð£ˆFó‹ «ð£¡ø ªî£™ªð£¼†èœ è‡ªì´‚èŠð†´œ÷ù.
        Þ‰Fòˆ ªî£™Lò™ ¶¬ø ãŸèù«õ «ñŸªè£‡ì Üèö£Œ¾èO™ ªõOŠð´ˆîŠð†ì
        è†´ñ£ùƒèœ ê£òˆªî£NŸê£¬ô Þ¼‰îîŸè£ù ê£¡Áèœ â¡Á ÃP»œ÷¶.
        îŸ«ð£¬îò Üèö£Œ¾èO½‹ A¬ìˆ¶œ÷ ªïê¾ ªî£ì˜ð£ù ªî£™ªð£¼†èœ, ÞŠð°FJ™
        ªïê¾ˆ ªî£N™ Cø‰¶ M÷ƒAòîŸ°„ ê£¡Á ðè˜A¡øù."""

        text_uni="""இவ்வகழாய்வுகளில் நூல்களை நூற்க பயன்படும் தக்களி (10), துணிகளில் உருவ
        வடிவமைப்புகளை வரைவதற்கு உபயோகப்படுத்தப்படும் எலும்பிலான கூரிய முனைகள்கொண்ட
        தூரிகை (20), தறியில் தொங்கவிடும் கருங்கல் மற்றும் சுடுமண்ணால் செய்யப்பட்ட குண்டு,
        செம்பினாலான ஊசி, சுடுமண்பாத்திரம் போன்ற தொல்பொருட்கள் கண்டெடுக்கப்பட்டுள்ளன.
        இந்தியத் தொல்லியல் துறை ஏற்கனவே மேற்கொண்ட அகழாய்வுகளில் வெளிப்படுத்தப்பட்ட
        கட்டுமானங்கள் சாயத்தொழிற்சாலை இருந்ததற்கான சான்றுகள் என்று கூறியுள்ளது.
        தற்போதைய அகழாய்வுகளிலும் கிடைத்துள்ள நெசவு தொடர்பான தொல்பொருட்கள், இப்பகுதியில்
        நெசவுத் தொழில் சிறந்து விளங்கியதற்குச் சான்று பகர்கின்றன."""
        assert self.to_unicode(text_tam)==text_uni